
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
  * module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
* Delete
  * kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_untrusted_workloads
  * kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - &#39;--name=*&#39;\n          - &#39;--config=*&#39;\n          - &#39;--context=*&#39;\n          - &#39;--dockerfile=*&#39;\n          - --log-dir=/\n      - image: \&#34;gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\&#34;\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - &#39;--name=*&#39;\n          - &#39;--config=*&#39;\n          - &#39;--context=*&#39;\n          - &#39;--dockerfile=*&#39;\n          - --log-dir=/\n      - image: \&#34;gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\&#34;\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads will be destroyed
  # (because kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role" "access_pjtester_secrets_trusted_workloads" {
      - id = "access-pjtester-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-pjtester-secrets" -> null
          - resource_version = "613065307" -> null
          - uid              = "2240e76d-861f-4aa7-8073-fa6084369b66" -> null
        }

      - rule {
          - api_groups        = [
              - "",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [
              - "pjtester-kubeconfig",
              - "pjtester-github-oauth-token",
            ] -> null
          - resources         = [
              - "secrets",
            ] -> null
          - verbs             = [
              - "update",
              - "get",
              - "list",
              - "watch",
              - "patch",
              - "create",
              - "delete",
            ] -> null
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_trusted_workloads will be destroyed
  # (because kubernetes_cluster_role.access_signify_secrets_trusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role" "access_signify_secrets_trusted_workloads" {
      - id = "access-signify-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-signify-secrets" -> null
          - resource_version = "613065306" -> null
          - uid              = "170cba60-a4e3-4b34-ae57-ca6f3052b1a5" -> null
        }

      - rule {
          - api_groups        = [
              - "",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [
              - "signify-dev-secret",
              - "signify-prod-secret",
            ] -> null
          - resources         = [
              - "secrets",
            ] -> null
          - verbs             = [
              - "update",
              - "get",
              - "list",
              - "watch",
              - "patch",
              - "create",
              - "delete",
            ] -> null
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_untrusted_workloads will be destroyed
  # (because kubernetes_cluster_role.access_signify_secrets_untrusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role" "access_signify_secrets_untrusted_workloads" {
      - id = "access-signify-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-signify-secrets" -> null
          - resource_version = "609008170" -> null
          - uid              = "16f377ce-2f17-4be5-9ffc-a1da1b366dd0" -> null
        }

      - rule {
          - api_groups        = [
              - "",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [
              - "signify-dev-secret",
              - "signify-prod-secret",
            ] -> null
          - resources         = [
              - "secrets",
            ] -> null
          - verbs             = [
              - "update",
              - "get",
              - "list",
              - "watch",
              - "patch",
              - "create",
              - "delete",
            ] -> null
        }
    }

  # kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads will be destroyed
  # (because kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role_binding" "access_pjtester_secrets_trusted_workloads" {
      - id = "access-pjtester-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-pjtester-secrets" -> null
          - resource_version = "613067610" -> null
          - uid              = "f2c3094c-c959-4745-925a-3120e2b3f030" -> null
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "access-pjtester-secrets" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "secret-manager-trusted" -> null
          - namespace = "external-secrets" -> null
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads will be destroyed
  # (because kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_trusted_workloads" {
      - id = "access-signify-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-signify-secrets" -> null
          - resource_version = "613067611" -> null
          - uid              = "be3adef2-c4bc-4e88-9908-a59350c940cc" -> null
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "access-signify-secrets" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "secret-manager-trusted" -> null
          - namespace = "external-secrets" -> null
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads will be destroyed
  # (because kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads is not in configuration)
  - resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_untrusted_workloads" {
      - id = "access-signify-secrets" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "access-signify-secrets" -> null
          - resource_version = "609010410" -> null
          - uid              = "402363ad-a5d4-4854-8095-6358ec83067d" -> null
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "access-signify-secrets" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "secret-manager-trusted" -> null
          - namespace = "external-secrets" -> null
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be created
  + resource "kubernetes_secret" "terraform_executor" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "terraform-executor"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be created
  + resource "kubernetes_service_account" "terraform_executor" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] will be destroyed
  # (because key ["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor-sa-trusted-usage" -> null
      - kind                    = "ServiceAccountTrustedUsage" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "b48ef853-e0d6-4012-aeef-3a806caee253" -> null
      - name                    = "terraform-executor-sa-trusted-usage" -> null
      - server_side_apply       = false -> null
      - uid                     = "b48ef853-e0d6-4012-aeef-3a806caee253" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor-sa-trusted-usage
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - image-builder
                trustedImages:
                - args:
                  - -wait_file
                  - /tekton/downward/ready
                  - -wait_file_content
                  - -post_file
                  - /tekton/run/0/out
                  - -termination_path
                  - /tekton/termination
                  - -step_metadata_dir
                  - /tekton/run/0/status
                  - -entrypoint
                  - /image-builder
                  - --
                  - --name=*
                  - --config=*
                  - --context=*
                  - --dockerfile=*
                  - --log-dir=/
                  command:
                  - /tekton/bin/entrypoint
                  image: eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - command:
                  - /ko-app/entrypoint
                  - init
                  - /ko-app/entrypoint
                  - /tekton/bin/entrypoint
                  - step-build-image
                  image: gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be created
  + resource "kubernetes_secret" "terraform_executor" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "terraform-executor"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] will be destroyed
  # (because key ["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor-sa-trusted-usage" -> null
      - kind                    = "ServiceAccountTrustedUsage" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "2eae4e6a-62b1-498b-badc-6cd6ffae8b62" -> null
      - name                    = "terraform-executor-sa-trusted-usage" -> null
      - server_side_apply       = false -> null
      - uid                     = "2eae4e6a-62b1-498b-badc-6cd6ffae8b62" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor-sa-trusted-usage
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - image-builder
                trustedImages:
                - args:
                  - -wait_file
                  - /tekton/downward/ready
                  - -wait_file_content
                  - -post_file
                  - /tekton/run/0/out
                  - -termination_path
                  - /tekton/termination
                  - -step_metadata_dir
                  - /tekton/run/0/status
                  - -entrypoint
                  - /image-builder
                  - --
                  - --name=*
                  - --config=*
                  - --context=*
                  - --dockerfile=*
                  - --log-dir=/
                  command:
                  - /tekton/bin/entrypoint
                  image: eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - command:
                  - /ko-app/entrypoint
                  - init
                  - /ko-app/entrypoint
                  - /tekton/bin/entrypoint
                  - step-build-image
                  image: gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be created
  + resource "kubernetes_secret" "terraform_executor" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "terraform-executor"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 8 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor,
  on ../../../../development/terraform-executor/terraform/modules/k8s-terraform-executor/main.tf line 15, in resource "kubernetes_service_account" "terraform_executor":
  15: resource "kubernetes_service_account" "terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7910,"Program":"tfcmt","SHA1":"0e50b25c855ffcea49afc13774392e87ad366eb5","Vars":{}} -->